from aiogram import Bot, Dispatcher
from aiogram.contrib.fsm_storage.memory import MemoryStorage
from database.data import Database

db = Database("data.db")
# ___________________________________________________________________
admin_id = [737481440]  # Сюда вставляем всех админов через запятую [123123, 837148, 12312] или только одного [123]
verification = False  # True - если хотите поставить проверку на человека
token = "7440029877:AAENnTHSpbm6oj92559C2y99v6qTzsONzqY"  # токен бота

vxod_worker = "/воркер"

shop_name = "Narko"  # название шопа
admin_chat = "sjsjaao"  # username админа для связи без @
feedback_link = "https://"  # ссылка на канал с отзывами

qiwi = "lolwtf"  # телефон киви или ник
card = "1234123412341234"  # номер карты
bitcoin = "0xoi213kj453123"  # адрес битка
# ___________________________________________________________________

any_data = {"city_key": {"Москва": "moskow_zone",
                         "С. Петербург": "sankt_zone",
                         "Казань": "kazan_zone",
                         "Екатеринбург": "ekb_zone",
                         "Сочи": "sochi_zone",
                         "Краснодар": "krasnodar_zone"},

            "city": {"Москва", "С. Петербург", "Казань", "Екатеринбург", "Сочи", "Краснодар"},

            "zone": {"Измайлово": "1", "Внуково": "1", "Сокольники": "1", "Кунцево": "1", "Крюково": "1", "Лефортово": "1", "Выхино": "1",
                     "Медведково": "1", "Щукино": "1", "Якиманка": "1", "Невский": "2", "Петроградский": "2", "Василеостровской": "2",
                     "Советский": "3", "Приволжский": "3", "Вахитовский": "3", "Ново-Савиновский": "3", "Московский": "3",
                     "Верх-Исетский": "4", "Кировский": "4", "Железнодорожный": "4", "Ленинский": "4", "Октябрьский": "4",
                     "Адлерский": "5", "Хостинский": "5", "Лазаревский": "6", "Западный": "6", "Прикубанский": "6", "Карасунский": "6", "Центральный": "6"},

            "city_zone": {"Москва": ["Измайлово", "Внуково", "Сокольники", "Кунцево", "Крюково", "Лефортово", "Выхино", "Медведково", "Щукино", "Якиманка"],
                          "С. Петербург": ["Центральный", "Невский", "Кировский", "Московский", "Петроградский", "Василеостровской"],
                          "Казань": ["Советский", "Кировский", "Приволжский", "Вахитовский", "Ново-Савиновский", "Московский"],
                          "Екатеринбург": ["Верх-Исетский", "Кировский", "Железнодорожный", "Ленинский", "Октябрьский"],
                          "Сочи": ["Центральный", "Адлерский", "Хостинский", "Лазаревский"],
                          "Краснодар": ["Западный", "Прикубанский", "Карасунский", "Центральный"]},

            "product": {"1": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Шишки (АК47)", "Мефедрон", "Героин HQ", "Спайс", "Шишко-План"],
                        "2": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Шишки (АК47)"],
                        "3": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Мефедрон", "Спайс", "Героин HQ"],
                        "4": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Мефедрон", "Спайс", "Героин HQ"],
                        "5": ["Alpha PVP", "Гашиш Euro", "Амфетамин", "Спайс"],
                        "6": ["Alpha PVP", "Амфетамин"]},

            "product_price": {"Alpha PVP": ['0.3г (900 руб)', '0.5г (1300 руб)', '1г (2200 руб)', '3г (5500 руб)'],
                              "Гашиш Euro": ['1г (1100 руб)', '2г (2000 руб)', '5г (4000 руб)', '10г (6000 руб)'],
                              "Амфетамин": ['1г (950 руб)', '2г (1800 руб)', '5г (4100 руб)', '10г (6500 руб)'],
                              "Шишки (АК47)": ['1г (1200 руб)', '2г (2200 руб)', '5г (4200 руб)'],
                              "Мефедрон": ['1г (2100 руб)', '2г (4000 руб)', '5г (8000 руб)'],
                              "Героин HQ": ['0.5 (1700 руб)'],
                              "Спайс": ['1г (1200 руб)', '2г (2200 руб)', '5г (4200 руб)'],
                              "Шишко-План": ['1г (550 руб)', '3г (1500 руб)']},

            "price": {'0.3г (900 руб)', '0.5г (1300 руб)', '1г (2200 руб)', '3г (5500 руб)',
                      '1г (1100 руб)', '2г (2000 руб)', '5г (4000 руб)', '10г (6000 руб)',
                      '1г (950 руб)', '2г (1800 руб)', '5г (4100 руб)', '10г (6500 руб)',
                      '1г (1200 руб)', '2г (2200 руб)', '5г (4200 руб)',
                      '1г (2100 руб)', '2г (4000 руб)', '5г (8000 руб)', '0.5 (1700 руб)',
                      '1г (550 руб)', '3г (1500 руб)'}

            }  # в price должны быть все цены(без повторений) из product_price


bot = Bot(token=token)
storage = MemoryStorage()
dp = Dispatcher(bot, storage=storage)
